Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 244, 32)      320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 224, 244, 32)      9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 122, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 112, 122, 64)      18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 122, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 61, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 56, 61, 128)       73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 56, 61, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 30, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 107520)            0         
_________________________________________________________________
dense (Dense)                (None, 128)               13762688  
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 774       
=================================================================
Total params: 14,049,894
Trainable params: 14,049,894
Non-trainable params: 0
_________________________________________________________________
